{"id": "goutam-kulsi", "name": "Dr. Goutam Kulsi", "position": "Founding Director & CEO", "image": "/assets/images/team/dr-goutam-kulsi.webp", "bio": "Dr. Goutam Kulsi is a scientist and passionate entrepreneur, currently serving as the Founding Director and Chief Executive Officer of ChemActiva Innovations. He earned his Ph.D. from CSIR-Indian Institute of Chemical Biology (IICB), Kolkata, and Postdoctoral studies at Seoul National University, South Korea. With over eight years of experience in startup domain, Dr. Kulsi blends deep scientific knowledge with strategic entrepreneurial vision.", "responsibilities": "At ChemActiva Innovations, he leads cutting-edge research, mentor scientific team, and steers the company's mission to develop sustainable solutions for real-world challenges. Under his leadership, the company has secured early-stage funding, and established small scale production in RISE foundation IISER. He is passionate about advancing circular economy solutions through scalable, bio-based innovations.", "contact": ""}
{"id": "soumitra-hazra", "name": "Dr. Soumitra Hazra", "position": "Scientific Manager", "image": "", "bio": "Dr. Soumitra Hazra is a scientific professional currently serving as Scientific Manager at ChemActiva Innovations. He holds a Ph.D. from CSIR–Indian Institute of Chemical Biology (IICB), Kolkata, and has postdoctoral research experience in Japan.", "responsibilities": "At ChemActiva Innovations, Dr. Hazra plays a key role in leading scientific initiatives, product development, and innovations. With 5 years of industry experience, Dr. Hazra combines deep scientific expertise with strategic leadership to drive innovation and translate research into commercially viable solutions.", "contact": ""}
{"id": "pompa-dan", "name": "Ms. Pompa Dan", "position": "Finance Manager", "image": "/assets/images/team/pompa-dan.webp", "bio": "Ms. Dan oversees the finance operations at our company, bringing strong analytical skills and attention to detail to manage budgets, financial planning. She holds an M.Sc. in Physics from Delhi University and combines her technical background with a practical approach to financial management.", "responsibilities": "Financial planning, budget management, and strategic financial analysis.", "contact": ""}
{"id": "uma-paul", "name": "Uma Paul", "position": "Supply Chain Manager", "image": "/assets/images/team/uma-paul.webp", "bio": "Manages the supply chain of raw materials and ensures efficient procurement processes.", "responsibilities": "Supply chain management and raw material procurement.", "contact": ""}
{"id": "keya-mandal", "name": "Ms. Keya Mandal", "position": "Team Member", "image": "/assets/images/team/keya-mandal.webp", "bio": "", "responsibilities": "", "contact": ""}
{"id": "kushagra-advani", "name": "Mr. Kushagra Advani", "position": "Team Member", "image": "/assets/images/team/kushagra-advani.webp", "bio": "", "responsibilities": "", "contact": ""}
{"id": "singdha-ghosh", "name": "Ms. Singdha Ghosh", "position": "Team Member", "image": "/assets/images/team/singdha-ghosh.webp", "bio": "", "responsibilities": "", "contact": ""}
{"id": "sandra-surendran", "name": "Ms. Sandra Surendran", "position": "Team Member", "image": "", "bio": "", "responsibilities": "", "contact": ""}
{"id": "sarvaggya-goyel", "name": "Ms. Sarvaggya Goyel", "position": "Past Member", "image": "", "bio": "", "responsibilities": "", "contact": ""}
{"id": "rahul-mandal", "name": "Mr. Rahul Mandal", "position": "Past Member", "image": "/assets/images/team/rahul-mandal.webp", "bio": "", "responsibilities": "", "contact": ""}
{"id": "shipra-bharti", "name": "Ms. Shipra Bharti", "position": "Past Member", "image": "/assets/images/team/shipra-bharti.webp", "bio": "", "responsibilities": "", "contact": ""}
{"id": "prof-s-sivaram", "name": "Prof. Swaminathan Sivaram", "position": "Advisor", "image": "/assets/images/team/prof-s-sivaram.webp", "bio": "Prof. Swaminathan Sivaram is a Padma Shri awardee, distinguished Indian polymer chemist, inventor, and institution builder currently serving as an INSA Senior Scientist and Honorary Professor at IISER Pune and IISER Kolkata. Formerly the Director of the National Chemical Laboratory (NCL), Pune, Prof. Sivaram is internationally recognized for his pioneering contributions to polymer chemistry, especially in the development of biodegradable polymers and sustainable materials derived from renewable resources. His work has significantly advanced the fields of green chemistry and environmentally friendly materials.", "responsibilities": "", "contact": ""}
{"id": "prof-amitava-das", "name": "Prof. Amitava Das", "position": "Advisor", "image": "/assets/images/team/prof-amitava-das.webp", "bio": "Prof. Amitava Das is a Professor in the Department of Chemical Sciences at IISER Kolkata and former Director of CSIR-CSMCRI. A distinguished scientist, he is widely recognized for bridging academia and industry through impactful interdisciplinary work. With deep expertise in chemical sciences, his research has significantly advanced collaborative efforts in materials chemistry, energy, and sustainable technologies.", "responsibilities": "", "contact": ""}
{"id": "prof-sayam-sen-gupta", "name": "Prof. Sayam Sen Gupta", "position": "Advisor", "image": "/assets/images/team/prof-sayam-sen-gupta.webp", "bio": "Prof. Sayam Sen Gupta is a Professor in the Department of Chemical Sciences at IISER Kolkata, renowned for his significant contributions to bio-inspired catalysis and biomaterial sciences. A recipient of national teaching awards, Prof. Sen Gupta is a leading expert in interdisciplinary research, focusing on the development of innovative catalytic systems inspired by nature and the design of advanced biomaterials for applications in healthcare and environmental remediation. He has also played an instrumental role in integrating sustainable practices into academic curricula and industrial processes.", "responsibilities": "", "contact": ""}
{"id": "prof-anandamoy-puste", "name": "Prof. Anandamoy Puste", "position": "Advisor", "image": "", "bio": "Prof. Anandamoy Puste is a retired Professor from the Department of Agronomy at Bidhan Chandra Krishi Viswavidyalaya, West Bengal, and a distinguished expert in water and wetland management. He has led pioneering work in Shola plantation and sustainable agronomic practices. His contributions to ecological agriculture have been instrumental in optimizing water use, enhancing soil health, and promoting biodiversity in wetland ecosystems. Prof. Puste continues to guide research and policy related to sustainable farming and environmental conservation.", "responsibilities": "", "contact": ""}